iarsystems/ewarm-xhsc-example-projects/HC32F452/HC32F452_StartKit/GettingStarted/startup_hc32f452.s
                PUBWEAK IRQ072_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ072_Handler
                B       IRQ072_Handler

                PUBWEAK IRQ073_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ073_Handler
                B       IRQ073_Handler

                PUBWEAK IRQ074_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ074_Handler
                B       IRQ074_Handler

                PUBWEAK IRQ075_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ075_Handler
                B       IRQ075_Handler

                PUBWEAK IRQ076_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ076_Handler
                B       IRQ076_Handler

                PUBWEAK IRQ077_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ077_Handler
                B       IRQ077_Handler

                PUBWEAK IRQ078_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ078_Handler
                B       IRQ078_Handler

                PUBWEAK IRQ079_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ079_Handler
                B       IRQ079_Handler

                PUBWEAK IRQ080_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ080_Handler
                B       IRQ080_Handler

                PUBWEAK IRQ081_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ081_Handler
                B       IRQ081_Handler

                PUBWEAK IRQ082_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ082_Handler
                B       IRQ082_Handler

                PUBWEAK IRQ083_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ083_Handler
                B       IRQ083_Handler

                PUBWEAK IRQ084_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ084_Handler
                B       IRQ084_Handler

                PUBWEAK IRQ085_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ085_Handler
                B       IRQ085_Handler

                PUBWEAK IRQ086_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ086_Handler
                B       IRQ086_Handler

                PUBWEAK IRQ087_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ087_Handler
                B       IRQ087_Handler

                PUBWEAK IRQ088_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ088_Handler
                B       IRQ088_Handler

                PUBWEAK IRQ089_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ089_Handler
                B       IRQ089_Handler

                PUBWEAK IRQ090_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ090_Handler
                B       IRQ090_Handler

                PUBWEAK IRQ091_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ091_Handler
                B       IRQ091_Handler

                PUBWEAK IRQ092_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ092_Handler
                B       IRQ092_Handler

                PUBWEAK IRQ093_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ093_Handler
                B       IRQ093_Handler

                PUBWEAK IRQ094_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ094_Handler
                B       IRQ094_Handler

                PUBWEAK IRQ095_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ095_Handler
                B       IRQ095_Handler

                PUBWEAK IRQ096_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ096_Handler
                B       IRQ096_Handler

                PUBWEAK IRQ097_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ097_Handler
                B       IRQ097_Handler

                PUBWEAK IRQ098_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ098_Handler
                B       IRQ098_Handler

                PUBWEAK IRQ099_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ099_Handler
                B       IRQ099_Handler

                PUBWEAK IRQ100_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ100_Handler
                B       IRQ100_Handler

                PUBWEAK IRQ101_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ101_Handler
                B       IRQ101_Handler

                PUBWEAK IRQ102_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ102_Handler
                B       IRQ102_Handler

                PUBWEAK IRQ103_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ103_Handler
                B       IRQ103_Handler

                PUBWEAK IRQ104_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ104_Handler
                B       IRQ104_Handler

                PUBWEAK IRQ105_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ105_Handler
                B       IRQ105_Handler

                PUBWEAK IRQ106_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ106_Handler
                B       IRQ106_Handler

                PUBWEAK IRQ107_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ107_Handler
                B       IRQ107_Handler

                PUBWEAK IRQ108_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ108_Handler
                B       IRQ108_Handler

                PUBWEAK IRQ109_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ109_Handler
                B       IRQ109_Handler

                PUBWEAK IRQ110_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ110_Handler
                B       IRQ110_Handler

                PUBWEAK IRQ111_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ111_Handler
                B       IRQ111_Handler

                PUBWEAK IRQ112_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ112_Handler
                B       IRQ112_Handler

